package cronis.mock.sliding_window.problem11;

// Дан массив слов. Найдите кратчайшее расстояние по количеству слов между двумя заданными словами.
// Неважно, слово1 или слово2 встретится первым. Операция повторяется много раз для разных пар слов.
//public class Solution {
//
//    public findMinDistanceBetweenWords(String[] words, String word1, String word2) {
//
//    }
//
//    public static void main(String[] args) {
//        var words = new String[]{"cat", "dog", "tiger", "lion", "bear", "zebra", "cow", "goat", "pig", "sheep"};
//        var word1 = "cat";
//        var word2 = "tiger";
//        var s = new Solution().solution(words, word1, word2);
//        System.out.println(s);
//    }
//}
